OdIfcEntResolver.resolve(OdIfc.OdIfcEntity*)
\details
Resolves the model's entity.
\param inst     [in] A raw pointer to the entity instance to be resolved.
\returns true if the entity was successfully resolved; otherwise, the method returns false.